In [1]:
import numpy as np
import pandas as pd

In [2]:
credits = pd.read_csv('data/credits.csv')
credits.head()

   person_id       id             name                character   role
0       3748  tm84618   Robert De Niro            Travis Bickle  ACTOR
1      14658  tm84618     Jodie Foster            Iris Steensma  ACTOR
2       7064  tm84618    Albert Brooks                      Tom  ACTOR
3       3739  tm84618    Harvey Keitel  Matthew 'Sport' Higgins  ACTOR
4      48933  tm84618  Cybill Shepherd                    Betsy  ACTOR

In [3]:
titles = pd.read_csv('data/titles.csv')
titles.head()

,id,title,type,description,release_year,age_certification,runtime,genres,production_countries,seasons,imdb_id,imdb_score,imdb_votes,tmdb_popularity,tmdb_score
0,ts300399,Five Came Back: The Reference Films,SHOW,This collection includes 12 World War II-era p...,1945,TV-MA,51,['documentation'],['US'],1.0,NaN,NaN,NaN,0.600,NaN
1,tm84618,Taxi Driver,MOVIE,A mentally unstable Vietnam War veteran works ...,1976,R,114,"['drama', 'crime']",['US'],NaN,tt0075314,8.2,808582.0,40.965,8.179
2,tm154986,Deliverance,MOVIE,Intent on seeing the Cahulawassee River before...,1972,R,109,"['drama', 'action', 'thriller', 'european']",['US'],NaN,tt0068473,7.7,107673.0,10.010,7.300
3,tm127384,Monty Python and the Holy Grail,MOVIE,"King Arthur, accompanied by his squire, recrui...",1975,PG,91,"['fantasy', 'action', 'comedy']",['GB'],NaN,tt0071853,8.2,534486.0,15.461,7.811
4,tm120801,The Dirty Dozen,MOVIE,12 American military prisoners in World War II...,1967,NaN,150,"['war', 'action']","['GB', 'US']",NaN,tt0061578,7.7,72662.0,20.398,7.600

### Checking Nulls in credits.csv

In [10]:
print('Number of null person_id: ', len(credits[credits['person_id'].isnull()]))
print('Number of null id: ', len(credits[credits['id'].isnull()]))
print('Number of null name: ', len(credits[credits['name'].isnull()]))
print('Number of null character: ', len(credits[credits['character'].isnull()]))
print('Number of null role: ', len(credits[credits['role'].isnull()]))

Number of null person_id:  0
Number of null id:  0
Number of null name:  0
Number of null character:  9772
Number of null role:  0

The only column that has null values in `credits.csv` is `character`, but for now it's okay to leave these null values in because it is not a crucial variable for our intended analysis.

### Checking Nulls in titles.csv

In [12]:
print('Number of null id: ', len(titles[titles['id'].isnull()]))
print('Number of null title: ', len(titles[titles['title'].isnull()]))
print('Number of null release_year: ', len(titles[titles['release_year'].isnull()]))

Number of null id:  0
Number of null title:  1
Number of null release_year:  0

In [20]:
titles = titles[titles['title'].notnull()]
print('Number of null title: ', len(titles[titles['title'].isnull()]))
titles.head()

Number of null title:  0

,id,title,type,description,release_year,age_certification,runtime,genres,production_countries,seasons,imdb_id,imdb_score,imdb_votes,tmdb_popularity,tmdb_score
0,ts300399,Five Came Back: The Reference Films,SHOW,This collection includes 12 World War II-era p...,1945,TV-MA,51,['documentation'],['US'],1.0,NaN,NaN,NaN,0.600,NaN
1,tm84618,Taxi Driver,MOVIE,A mentally unstable Vietnam War veteran works ...,1976,R,114,"['drama', 'crime']",['US'],NaN,tt0075314,8.2,808582.0,40.965,8.179
2,tm154986,Deliverance,MOVIE,Intent on seeing the Cahulawassee River before...,1972,R,109,"['drama', 'action', 'thriller', 'european']",['US'],NaN,tt0068473,7.7,107673.0,10.010,7.300
3,tm127384,Monty Python and the Holy Grail,MOVIE,"King Arthur, accompanied by his squire, recrui...",1975,PG,91,"['fantasy', 'action', 'comedy']",['GB'],NaN,tt0071853,8.2,534486.0,15.461,7.811
4,tm120801,The Dirty Dozen,MOVIE,12 American military prisoners in World War II...,1967,NaN,150,"['war', 'action']","['GB', 'US']",NaN,tt0061578,7.7,72662.0,20.398,7.600

There was only 1 observation that had a null title, so we removed this from the dataframe and will create a new csv file with the non-null values.

In [21]:
# titles.to_csv('data/titles_clean.csv')